11_Lab_Review/homework_submissions/Ritly/app/controllers/urls_controller.rb

	def search
		@query = params[:hash_code]

		@urls = Url.where("link LIKE ? or hash_code LIKE ?", "#{@query}%", "#{@query}%")
---
SELECT "urls".* FROM "urls" WHERE (link LIKE '8831%' or hash_code LIKE '8831%')

	def create
		url = Url.new(url_params)

		if url.save
---
INSERT INTO "urls" ("created_at", "hash_code", "link", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 21 Aug 2013 04:35:18 UTC +00:00], ["hash_code", 12345], ["link", "www.facebook.com"], ["updated_at", Wed, 21 Aug 2013 04:35:18 UTC +00:00]]

	def edit
		@url = Url.find(params[:id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "1"]]

	def update
		url = Url.find(params[:id])

		if url.update_attributes(url_params)
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "urls" SET "link" = ?, "hash_code" = ?, "updated_at" = ? WHERE "urls"."id" = 7  [["link", "http://www.espn.com"], ["hash_code", 99], ["updated_at", Thu, 22 Aug 2013 17:32:45 UTC +00:00]]

	def destroy
		url = Url.find(params[:id])

		url.destroy
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "urls" WHERE "urls"."id" = ?  [["id", 5]]

	def redirectors
		@hash_code = params[:some_totally_random_value]
		#redirect_to original weblink somehow - can redirect_to outside of your app
		#redirect_to params[:url]
		@url_object = Url.where(hash_code: @hash_code).first
---
SELECT "urls".* FROM "urls" WHERE "urls"."hash_code" = 784 ORDER BY "urls"."id" ASC LIMIT 1

	def preview
		@hash_code = params[:some_totally_random_value]
		@url_object = Url.where(hash_code: @hash_code).first
---
SELECT "urls".* FROM "urls" WHERE "urls"."hash_code" = 8653 ORDER BY "urls"."id" ASC LIMIT 1